import random
import csv

maid_data = {}
with open('resources/maid.csv', 'r', encoding='utf-8-sig') as file:
    csv_reader = csv.reader(file)
    for row in csv_reader:
        category, option, details = row
        if category in maid_data:
            maid_data[category][option] = details
        else:
            maid_data[category] = {option: details}


async def get_detailed_maid(string):
    input_str = string.rstrip('★')
    options = maid_data[input_str]
    if options:
        chosen, chosen_detail = random.choice(list(options.items()))
        result = f"\t{chosen}: {chosen_detail}\n"
        return result


async def gen_maid_character(name):
    string = f"{name}的女仆: \n"
    cha_attr = ["萝莉", "性感", "纯洁", "冷酷", "假小子", "骑士"]
    string = string + f"类型:{'、'.join(random.choices(cha_attr, k=2))}\n"
    colors = ["红色", "紫色", "橙色", "粉色", "褐色", "鲜红", "紫色", "蓝色", "绿色", "天蓝", "深蓝", "靛蓝", "橙色",
              "绿色", "黄色", "乳黄", "浅褐", "金色", "粉色", "天蓝", "浅褐", "白色", "灰色", "银色", "褐色", "靛蓝",
              "浅褐", "灰色", "黑色", "反光", "鲜红", "靛蓝", "金色", "银色", "反光", "透明或彩色"]
    string = string + f"制服主题色为{random.choice(colors)},发色为{random.choice(colors)},瞳色为{random.choice(colors)}\n"
    traits = {"眼睛娘": "你戴着眼镜。眼镜的具体款式由你决定，但不允许使用隐形眼镜。",
              "雀斑": "你长着雀斑。",
              "病弱": "你患有某种无法治愈的疾病，但不会影响属性。具体症状由你选择。",
              "无口": "你举止冷酷，不引人注目。哦，不会有具体规则来限制你的讲话频率的。",
              "随和/天然": "你办事缓慢镇定，总是依照自己的步调。这不会影响你的属性。",
              "洁癖": "你对干净整洁极为执着，难以忽视任何脏乱之处。",
              "褐色皮肤": "你的皮肤颜色较深，可能出于天生，也可能是日照的缘故。",
              "白化病": "你缺乏色素。你不见得完全没有颜色，只不过皮肤十分苍白。",
              "害羞": "你非常害羞。见到陌生的 NPC 就一句话也说不出。",
              "伪娘": "你其实是个男性（女装）。原则上双性人也可以。",
              "幻想癖": "你很容易沉浸到自己的幻想世界，或者经常做白日梦。",
              "贪财": "拜金主义者，为了钱可以做任何事情。",
              "精灵耳朵": "你有长而尖的耳朵。",
              "猫耳": "这一项可根据设定作些调整。基本上，你长着猫耳，很可能还有尾巴。",
              "机械/人偶": "你是个具有人类外表的机器人。你身体的某些部分很明显是人工制品。",
              "吸血鬼": "你是个吸血鬼，长着尖尖的长牙。你的扮演要很……吸血鬼。",
              "公主": "你其实是某个比你主人还要显赫的家庭的女儿，甚至可能是某国皇室，具体取决于设定。是否要掩饰身份由你决定。",
              "天使/恶魔": "你是来自某个以正义/邪恶世界的异界存在。人物起源和细节由你决定。",
              "制服★": "你对自己的制服作了一番修饰，转表：制服。",
              "徽记★": "你的制服头饰上有个特殊记号，转表：徽记。",
              "不良★": "你某些方面表现出少年犯倾向，转表：不良。",
              "口癖★": "你有一种独特的讲话方式，转表：口癖。",
              "发型★": "你的发型独特，转表：发型。",
              "饰物★": "你的制服上有某种特殊饰物，转表：饰物。",
              "关系★": "明快风格的游戏？你与另一名玩家（女仆）有某种联系，转表：关系。",
              "反常★": "黑暗风格的游戏？你有某种怪异的性反常行为，转表：性反常。",
              "犯罪倾向★": "你有某种犯罪倾向，转表：犯罪倾向。",
              "外伤★": "由于虐待或事故，你受到了某种永久性外科创伤，转表：外伤。",
              "悲剧爱情★": "你经历过一段悲伤的爱情，转表：悲剧爱情。",
              "黑暗往事★": "你有一段黑暗的个人经历，转表：黑暗往事。",
              "精神创伤★": "由于一起恐怖的事件，你的心智受到创伤。转表：精神创伤。",
              "秘密工作★": "你不只是个女仆。你还在秘密从事另一份工作。转表：秘密工作。",
              "组织成员★": "你不仅是个女仆，同时还隶属某个组织，转表：组织成员。",
              "变形者★": "你是某种变成女仆形态的动物，转表：变形者。",
              "怪物★": "你不是人类，而是某种怪物，转表：怪物。",
              "魔法★": "你能使用某种程度的魔法，转表：魔法。",
              "荒诞★": "你是某种彻底反抗常识的东西，转表：荒谬。"}
    goal = {"负债": "你家人欠了一笔天文数字的债务，把你送去宅邸工作抵债。", "奴隶": "你是个奴隶，没法自己选择工作。",
            "女主人": "虽然做女仆的工作，但其实你是主人的恋人。", "复仇": "主人是你的仇敌。你潜入宅邸伺机寻仇。",
            "孤儿": "你是被主人或主人的双亲收养的孤儿。", "私生女": "你是个私生女。你的法律地位和主人没有区别。",
            "仆人世家": "你出生于一个世代服侍主人的家庭。",
            "自我惩罚": "为了责罚自己的经验匮乏或某种罪行，你承担了女仆的工作。",
            "单相思": "被自己对主人一厢情愿的感情驱使，你来到这里。", "生意关系": "你做女仆是为了拿工资。就是如此。",
            "潜伏者": "与主人敌对的组织遣你来此，作为间谍甚至刺客。", "忠诚": "你对主人忠心耿耿。",
            "青梅竹马": "你与主人是儿时玩伴，你动用了这一层关系来此。",
            "女仆志愿": "你从小就羡慕那些女仆，经过艰苦努力你终于也成为了她们中的一员。",
            "报恩": "主人曾于你有大恩，你做了他的女仆以回报。", "远亲": "你与主人只是远亲，但你父母执意送你来照顾他。",
            "新娘修业": "你为了练习做一名理想的新娘而当了女仆。", "谁知道？": "你也不太清楚自己为什么要做这份工作"}
    string = string + "特质:\n"
    for i in range(random.randint(2, 5)):
        picked_trait, trait_desc = random.choice(list(traits.items()))
        string = string + f"{picked_trait}:{trait_desc}\n"
        if picked_trait[-1] == "★":
            string = string + await get_detailed_maid(picked_trait)
    picked_goal, goal_desc = random.choice(list(goal.items()))
    string = string + f"目的：{picked_goal} {goal_desc}\n"

    return string
